{"config": [{"config": {"batch_input_shape": [null, 66, 220, 3], "border_mode": "valid", "name": "convolution2d_1", "input_dtype": "float32", "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "nb_filter": 24, "nb_row": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 36, "subsample": [2, 2], "nb_row": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 48, "subsample": [2, 2], "nb_row": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "input_dim": 1280, "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 100, "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 50, "init": "he_normal", "activation": "relu", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "name": "dense_3", "output_dim": 10, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 10, "init": "he_normal", "activation": "linear", "b_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "name": "dense_4", "output_dim": 1, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}