{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_7", "init": "glorot_uniform", "batch_input_shape": [null, 80, 240, 3], "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 7, "b_constraint": null, "trainable": true, "input_dtype": "float32", "nb_col": 7, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_8", "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "b_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 192}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.4, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_7", "init": "glorot_uniform", "input_dim": 36288, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "output_dim": 128, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_8", "init": "glorot_uniform", "input_dim": 128, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "output_dim": 1, "activity_regularizer": null}}]}