{"config": [{"config": {"batch_input_shape": [null, 66, 220, 3], "border_mode": "valid", "nb_col": 5, "init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "nb_filter": 24, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "nb_col": 5, "init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "nb_filter": 36, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "nb_col": 5, "init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "nb_filter": 48, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "nb_col": 3, "init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "nb_col": 3, "init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "input_dim": 1280, "bias": true}, "class_name": "Dense"}, {"config": {"init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "input_dim": 100, "bias": true}, "class_name": "Dense"}, {"config": {"init": "he_normal", "trainable": true, "activation": "relu", "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "input_dim": 50, "bias": true}, "class_name": "Dense"}, {"config": {"init": "he_normal", "trainable": true, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "input_dim": 10, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}