{"config": [{"config": {"batch_input_shape": [null, 66, 220, 3], "init": "he_normal", "activation": "relu", "nb_col": 5, "b_constraint": null, "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "activation": "relu", "nb_col": 5, "b_constraint": null, "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "activation": "relu", "nb_col": 5, "b_constraint": null, "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "activation": "relu", "nb_col": 3, "b_constraint": null, "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "activation": "relu", "nb_col": 3, "b_constraint": null, "bias": true, "name": "convolution2d_5", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 1280, "init": "he_normal", "activation": "relu", "output_dim": 100, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"input_dim": 100, "init": "he_normal", "activation": "relu", "output_dim": 50, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"input_dim": 50, "init": "he_normal", "activation": "relu", "output_dim": 10, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"input_dim": 10, "init": "he_normal", "activation": "linear", "output_dim": 1, "trainable": true, "bias": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "W_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}