{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 66, 220, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001e<ipython-input-6-a4f69ed58b77>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "arguments": {}, "output_shape": [66, 220, 3]}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_filter": 24, "nb_row": 5, "batch_input_shape": [null, 66, 220, 3], "W_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "name": "convolution2d_1", "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_col": 5, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_col": 5, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "name": "convolution2d_4", "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "name": "convolution2d_5", "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "input_dim": 1280, "output_dim": 100, "b_regularizer": null, "init": "he_normal", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "input_dim": 100, "output_dim": 50, "b_regularizer": null, "init": "he_normal", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "input_dim": 50, "output_dim": 10, "b_regularizer": null, "init": "he_normal", "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "input_dim": 10, "output_dim": 1, "b_regularizer": null, "init": "he_normal", "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "bias": true, "W_constraint": null}}], "keras_version": "1.2.1"}