{"config": [{"config": {"function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "output_shape": [66, 220, 3], "input_dtype": "float32", "trainable": true, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-607223709795>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 220, 3]}, "class_name": "Lambda"}, {"config": {"init": "he_normal", "border_mode": "valid", "input_dtype": "float32", "b_constraint": null, "nb_row": 5, "bias": true, "nb_filter": 24, "trainable": true, "name": "convolution2d_1", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "batch_input_shape": [null, 66, 220, 3], "subsample": [2, 2], "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "border_mode": "valid", "bias": true, "b_constraint": null, "nb_row": 5, "nb_filter": 36, "trainable": true, "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "border_mode": "valid", "bias": true, "b_constraint": null, "nb_row": 5, "nb_filter": 48, "trainable": true, "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "activation": "relu", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "border_mode": "valid", "bias": true, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "trainable": true, "name": "convolution2d_4", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "border_mode": "valid", "bias": true, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "trainable": true, "name": "convolution2d_5", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "activation": "relu", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "he_normal", "name": "dense_1", "b_constraint": null, "trainable": true, "input_dim": 1280, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "W_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "name": "dense_2", "b_constraint": null, "trainable": true, "input_dim": 100, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "W_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "name": "dense_3", "b_constraint": null, "trainable": true, "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "W_constraint": null, "bias": true, "activation": "relu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "name": "dense_4", "b_constraint": null, "trainable": true, "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}