{"config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape": [66, 220, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-8ed5738a4e45>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "name": "lambda_1", "function_type": "lambda", "batch_input_shape": [null, 66, 220, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "subsample": [2, 2], "nb_col": 5, "activation": "relu", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "input_dtype": "float32", "nb_row": 5, "batch_input_shape": [null, 66, 220, 3]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "nb_col": 5, "activation": "relu", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "nb_col": 5, "activation": "relu", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "nb_row": 5}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.0, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 3, "activation": "relu", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "subsample": [1, 1], "nb_col": 3, "activation": "relu", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_row": 3}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.0, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "he_normal", "b_regularizer": null, "name": "dense_1", "trainable": true, "activation": "relu", "bias": true, "W_constraint": null, "input_dim": 1280}}, {"class_name": "Dense", "config": {"output_dim": 50, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "he_normal", "b_regularizer": null, "name": "dense_2", "trainable": true, "activation": "relu", "bias": true, "W_constraint": null, "input_dim": 100}}, {"class_name": "Dense", "config": {"output_dim": 10, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "he_normal", "b_regularizer": null, "name": "dense_3", "trainable": true, "activation": "relu", "bias": true, "W_constraint": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "he_normal", "b_regularizer": null, "name": "dense_4", "trainable": true, "activation": "linear", "bias": true, "W_constraint": null, "input_dim": 10}}], "class_name": "Sequential", "keras_version": "1.2.1"}