{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "he_normal", "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "trainable": true, "activation": "relu", "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 66, 220, 3], "nb_row": 5, "subsample": [2, 2], "nb_filter": 24, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "name": "convolution2d_2", "nb_col": 5, "trainable": true, "activation": "relu", "W_constraint": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "nb_filter": 36, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "name": "convolution2d_3", "nb_col": 5, "trainable": true, "activation": "relu", "W_constraint": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "nb_filter": 48, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "name": "convolution2d_4", "nb_col": 3, "trainable": true, "activation": "relu", "W_constraint": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "name": "convolution2d_5", "nb_col": 3, "trainable": true, "activation": "relu", "W_constraint": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "input_dim": 1280, "output_dim": 100, "name": "dense_1", "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "input_dim": 100, "output_dim": 50, "name": "dense_2", "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "input_dim": 50, "output_dim": 10, "name": "dense_3", "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "input_dim": 10, "output_dim": 1, "name": "dense_4", "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "bias": true}}]}