{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-8a5272c2b9fc>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "name": "lambda_2", "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 66, 220, 3], "output_shape": [66, 220, 3], "trainable": true, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "b_regularizer": null, "init": "he_normal", "input_dtype": "float32", "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "nb_col": 5, "batch_input_shape": [null, 66, 220, 3], "activation": "elu", "bias": true, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "nb_filter": 24, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "activation": "elu", "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "activation": "elu", "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "activation": "elu", "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "activation": "elu", "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "elu", "init": "he_normal", "output_dim": 100, "input_dim": 1280, "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"activation": "elu", "init": "he_normal", "output_dim": 50, "input_dim": 100, "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"activation": "elu", "init": "he_normal", "output_dim": 10, "input_dim": 50, "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "init": "he_normal", "output_dim": 1, "input_dim": 10, "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}