{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape": [66, 220, 3], "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 66, 220, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-8a5272c2b9fc>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "function_type": "lambda", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "batch_input_shape": [null, 66, 220, 3], "border_mode": "valid", "trainable": true, "nb_row": 5, "activation": "elu", "init": "he_normal", "name": "convolution2d_1", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24, "nb_col": 5, "input_dtype": "float32", "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "activation": "elu", "init": "he_normal", "name": "convolution2d_2", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 36, "nb_col": 5, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "activation": "elu", "init": "he_normal", "name": "convolution2d_3", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 48, "nb_col": 5, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "activation": "elu", "init": "he_normal", "name": "convolution2d_4", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 3, "activation": "elu", "init": "he_normal", "name": "convolution2d_5", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "he_normal", "activation": "elu", "name": "dense_1", "input_dim": 1280, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 100, "trainable": true, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "he_normal", "activation": "elu", "name": "dense_2", "input_dim": 100, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 50, "trainable": true, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "he_normal", "activation": "elu", "name": "dense_3", "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 10, "trainable": true, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "he_normal", "activation": "linear", "name": "dense_4", "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 1, "trainable": true, "W_constraint": null, "b_constraint": null}}], "class_name": "Sequential"}