{"config": [{"config": {"b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_11", "batch_input_shape": [null, 66, 220, 3], "activation": "relu", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 24, "W_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "he_normal", "input_dtype": "float32", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_12", "activation": "relu", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_13", "activation": "relu", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null, "name": "convolution2d_14", "activation": "relu", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null, "name": "convolution2d_15", "activation": "relu", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "border_mode": "valid", "bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "input_dim": 1280, "W_regularizer": null, "activation": "relu", "trainable": true, "b_regularizer": null, "name": "dense_9", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "he_normal", "output_dim": 100}, "class_name": "Dense"}, {"config": {"b_constraint": null, "input_dim": 100, "W_regularizer": null, "activation": "relu", "trainable": true, "b_regularizer": null, "name": "dense_10", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "he_normal", "output_dim": 50}, "class_name": "Dense"}, {"config": {"b_constraint": null, "input_dim": 50, "W_regularizer": null, "activation": "relu", "trainable": true, "b_regularizer": null, "name": "dense_11", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "he_normal", "output_dim": 10}, "class_name": "Dense"}, {"config": {"b_constraint": null, "input_dim": 10, "W_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_12", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "he_normal", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}