{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 220, 3], "subsample": [2, 2], "nb_filter": 24, "border_mode": "valid", "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 5, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 5, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 5, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "init": "he_normal", "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "name": "dense_9", "activity_regularizer": null, "bias": true, "output_dim": 100, "activation": "relu", "b_constraint": null, "input_dim": 1280}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "name": "dense_10", "activity_regularizer": null, "bias": true, "output_dim": 50, "activation": "relu", "b_constraint": null, "input_dim": 100}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "name": "dense_11", "activity_regularizer": null, "bias": true, "output_dim": 10, "activation": "relu", "b_constraint": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "name": "dense_12", "activity_regularizer": null, "bias": true, "output_dim": 1, "activation": "linear", "b_constraint": null, "input_dim": 10}}]}