{"keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "nb_row": 5, "trainable": true, "batch_input_shape": [null, 66, 220, 3], "nb_col": 5, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "bias": true, "init": "he_normal", "border_mode": "valid", "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_2", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 5, "nb_filter": 36, "W_regularizer": null, "subsample": [2, 2], "bias": true, "init": "he_normal", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_3", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 5, "nb_filter": 48, "W_regularizer": null, "subsample": [2, 2], "bias": true, "init": "he_normal", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_4", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "bias": true, "init": "he_normal", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_5", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "bias": true, "init": "he_normal", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 100, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 1280, "bias": true, "init": "he_normal"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 50, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 100, "bias": true, "init": "he_normal"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "output_dim": 10, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 50, "bias": true, "init": "he_normal"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "output_dim": 1, "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 10, "bias": true, "init": "he_normal"}}], "class_name": "Sequential"}