{"config": [{"config": {"batch_input_shape": [null, 66, 220, 3], "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-11-8a5272c2b9fc>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape": [66, 220, 3], "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"batch_input_shape": [null, 66, 220, 3], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 24, "dim_ordering": "tf", "input_dtype": "float32", "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "nb_row": 5, "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 36, "dim_ordering": "tf", "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "nb_row": 5, "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "nb_row": 5, "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "nb_row": 3, "init": "he_normal", "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "nb_row": 3, "init": "he_normal", "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "init": "he_normal", "output_dim": 100, "input_dim": 1280, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "init": "he_normal", "output_dim": 50, "input_dim": 100, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "elu", "trainable": true, "bias": true, "init": "he_normal", "output_dim": 10, "input_dim": 50, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "init": "he_normal", "output_dim": 1, "input_dim": 10, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}