{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "nb_filter": 24, "nb_col": 5, "name": "convolution2d_1", "init": "he_normal", "b_constraint": null, "subsample": [2, 2], "input_dtype": "float32", "batch_input_shape": [null, 66, 220, 3], "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "nb_filter": 36, "nb_col": 5, "name": "convolution2d_2", "init": "he_normal", "b_constraint": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "nb_filter": 48, "nb_col": 5, "name": "convolution2d_3", "init": "he_normal", "b_constraint": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_4", "init": "he_normal", "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_5", "init": "he_normal", "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1280, "name": "dense_1", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "init": "he_normal"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 100, "name": "dense_2", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "init": "he_normal"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 50, "name": "dense_3", "activation": "relu", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "init": "he_normal"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 10, "name": "dense_4", "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "init": "he_normal"}}]}