{"config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 7, "subsample": [2, 2], "b_constraint": null, "nb_col": 7, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "input_dtype": "float32", "bias": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "bias": true, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "nb_filter": 192}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 128, "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 120768, "W_constraint": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 1, "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 128, "W_constraint": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2"}}], "class_name": "Sequential", "keras_version": "1.2.1"}