{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "output_shape": [66, 220, 3], "batch_input_shape": [null, 66, 220, 3], "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-f3f7c9473ea9>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "bias": true, "batch_input_shape": [null, 66, 220, 3], "name": "convolution2d_1", "input_dtype": "float32", "subsample": [2, 2], "trainable": true, "nb_col": 5, "border_mode": "valid", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "nb_col": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": 1280, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 100, "W_regularizer": null, "init": "he_normal", "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 100, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 50, "W_regularizer": null, "init": "he_normal", "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 50, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_3", "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 10, "W_regularizer": null, "init": "he_normal", "W_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 10, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "he_normal", "W_constraint": null}}]}