{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": [66, 220, 3], "batch_input_shape": [null, 66, 220, 3], "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "trainable": true, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-27f9008eeeaa>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 24, "nb_col": 5, "W_constraint": null, "name": "convolution2d_1", "nb_row": 5, "input_dtype": "float32", "border_mode": "valid", "activation": "relu", "b_regularizer": null, "init": "he_normal", "batch_input_shape": [null, 66, 220, 3], "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 36, "nb_col": 5, "W_constraint": null, "name": "convolution2d_2", "nb_row": 5, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 48, "nb_col": 5, "W_constraint": null, "name": "convolution2d_3", "nb_row": 5, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.01, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "W_constraint": null, "name": "convolution2d_4", "nb_row": 3, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "W_constraint": null, "name": "convolution2d_5", "nb_row": 3, "border_mode": "valid", "activation": "relu", "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.01, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 1280, "init": "he_normal", "W_regularizer": null, "b_constraint": null, "name": "dense_1", "W_constraint": null, "activation": "relu", "b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "output_dim": 100}}, {"class_name": "Dense", "config": {"input_dim": 100, "init": "he_normal", "W_regularizer": null, "b_constraint": null, "name": "dense_2", "W_constraint": null, "activation": "relu", "b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "output_dim": 50}}, {"class_name": "Dense", "config": {"input_dim": 50, "init": "he_normal", "W_regularizer": null, "b_constraint": null, "name": "dense_3", "W_constraint": null, "activation": "relu", "b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "output_dim": 10}}, {"class_name": "Dense", "config": {"input_dim": 10, "init": "he_normal", "W_regularizer": null, "b_constraint": null, "name": "dense_4", "W_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "trainable": true, "output_dim": 1}}]}