{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "he_normal", "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "bias": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 66, 220, 3], "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "activity_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "trainable": true, "bias": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "activity_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "trainable": true, "bias": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "subsample": [2, 2], "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "activity_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "trainable": true, "bias": true, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "activity_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "trainable": true, "bias": true, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 100, "name": "dense_1", "trainable": true, "bias": true, "init": "he_normal", "input_dim": 1280, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "W_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 50, "name": "dense_2", "trainable": true, "bias": true, "init": "he_normal", "input_dim": 100, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "W_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 10, "name": "dense_3", "trainable": true, "bias": true, "init": "he_normal", "input_dim": 50, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "W_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "name": "dense_4", "trainable": true, "bias": true, "init": "he_normal", "input_dim": 10, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null}}]}