{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape": [66, 220, 3], "batch_input_shape": [null, 66, 220, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-69446598a41a>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32", "name": "lambda_1", "arguments": {}, "trainable": true, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "relu", "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "batch_input_shape": [null, 66, 220, 3], "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "relu", "W_constraint": null, "border_mode": "valid", "nb_filter": 36, "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "b_regularizer": null, "activation": "relu", "W_constraint": null, "border_mode": "valid", "nb_filter": 48, "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "name": "convolution2d_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "relu", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "b_regularizer": null, "activation": "relu", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_constraint": null, "input_dim": 1280, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "bias": true, "init": "he_normal", "W_regularizer": null, "name": "dense_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "bias": true, "init": "he_normal", "W_regularizer": null, "name": "dense_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "bias": true, "init": "he_normal", "W_regularizer": null, "name": "dense_3", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true, "init": "he_normal", "W_regularizer": null, "name": "dense_4", "trainable": true}}]}